Tekla Open API Reference for Tekla Structures 2025
ProfileItem.SetEquivalentType Method
 Sets the equivalent type for the specified cross section.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetEquivalentType(
	int CrossSectionNumber,
	int EquivalentType
)
Public Function SetEquivalentType (
	CrossSectionNumber As Integer,
	EquivalentType As Integer
) As Boolean
Parameters
CrossSectionNumber
Type: System.Int32
The cross section number.
EquivalentType
Type: System.Int32
The equivalent type.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.SetEquivalentType(System.Int32,System.Int32)"]
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace